# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv')

In [3]:
data.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [4]:
label = []
for column in data.columns:
    label.append(column.lower())
data.columns = label

data = data.rename(columns={'customer lifetime value':'customer_lifetime_value','st':'state','monthly premium auto':'monthly_premium_auto','number of open complaints':'n_open_complaints', 'policy type':'policy_type', 'vehicle class':'vehicle_class', 'total claim amount':'total_claim_amount'})
data.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,n_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [5]:
categorical = ['state', 'gender', 'education', 'policy_type', 'vehicle_class']     
for column in categorical:
    print(data[column].value_counts())

state
Oregon        320
California    211
Arizona       186
Cali          120
Nevada         98
Washington     81
WA             30
AZ             25
Name: count, dtype: int64
gender
F         457
M         413
Male       39
female     28
Femal      17
Name: count, dtype: int64
education
Bachelor                324
College                 313
High School or Below    296
Master                   94
Doctor                   37
Bachelors                 7
Name: count, dtype: int64
policy_type
Personal Auto     780
Corporate Auto    234
Special Auto       57
Name: count, dtype: int64
vehicle_class
Four-Door Car    576
Two-Door Car     205
SUV              199
Sports Car        57
Luxury SUV        20
Luxury Car        14
Name: count, dtype: int64

In [6]:
data['gender'] = data['gender'].replace(['female','Femal','Male'],['F','F','M'])
data['gender'].unique()

array([nan, 'F', 'M'], dtype=object)

In [7]:
data['state'] = data['state'].replace(['AZ','Cali','WA'],['Arizona','California','Washington'])
data['state'].unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', nan],
      dtype=object)

In [8]:
data['education'] = data['education'].replace(['Bachelors'],['Bachelor'])
data['education'].unique()

array(['Master', 'Bachelor', 'High School or Below', 'College', 'Doctor',
       nan], dtype=object)

In [9]:
data['vehicle_class'] = data['vehicle_class'].replace(['Sports Car', 'Luxury SUV', 'Luxury Car'],['Luxury', 'Luxury', 'Luxury'])
data['vehicle_class'].unique()

array(['Four-Door Car', 'Two-Door Car', 'SUV', 'Luxury', nan],
      dtype=object)

In [10]:
data['customer_lifetime_value'] = data['customer_lifetime_value'].str[:-1]
data.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,n_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [11]:
print(data.dtypes)

customer                    object
state                       object
gender                      object
education                   object
customer_lifetime_value     object
income                     float64
monthly_premium_auto       float64
n_open_complaints           object
policy_type                 object
vehicle_class               object
total_claim_amount         float64
dtype: object

In [12]:
data['customer_lifetime_value'] =  pd.to_numeric(data['customer_lifetime_value'], errors = 'coerce')

In [13]:
data['total_claim_amount'] = data['total_claim_amount'].round(2)

In [14]:
data['n_open_complaints'].unique()

array(['1/0/00', '1/2/00', '1/1/00', '1/3/00', '1/5/00', '1/4/00', nan],
      dtype=object)

In [15]:
data['n_open_complaints']= data['n_open_complaints'].str.split('/').str[1]

In [16]:
data['n_open_complaints'].unique()

array(['0', '2', '1', '3', '5', '4', nan], dtype=object)

In [17]:
data['n_open_complaints'] =  pd.to_numeric(data['n_open_complaints'], errors = 'coerce')

In [18]:
print(data.dtypes)

customer                    object
state                       object
gender                      object
education                   object
customer_lifetime_value    float64
income                     float64
monthly_premium_auto       float64
n_open_complaints          float64
policy_type                 object
vehicle_class               object
total_claim_amount         float64
dtype: object

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers using `applymap()`.

In [19]:
data.isna().sum()

customer                   2937
state                      2937
gender                     3054
education                  2937
customer_lifetime_value    2940
income                     2937
monthly_premium_auto       2937
n_open_complaints          2937
policy_type                2937
vehicle_class              2937
total_claim_amount         2937
dtype: int64

In [20]:
data.isnull()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,n_open_complaints,policy_type,vehicle_class,total_claim_amount
0,False,False,True,False,True,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
4003,True,True,True,True,True,True,True,True,True,True,True
4004,True,True,True,True,True,True,True,True,True,True,True
4005,True,True,True,True,True,True,True,True,True,True,True
4006,True,True,True,True,True,True,True,True,True,True,True
4007,True,True,True,True,True,True,True,True,True,True,True

In [21]:
missing_values_df = pd.DataFrame(round(data.isna().sum()/len(data),4)*100) 
missing_values_df = missing_values_df.reset_index() # replace, reset index and become columns
missing_values_df.columns = ['column_name', 'percentage_of_missing_values'] # rename columns
display(missing_values_df)

                column_name  percentage_of_missing_values
0                  customer                         73.28
1                     state                         73.28
2                    gender                         76.20
3                 education                         73.28
4   customer_lifetime_value                         73.35
5                    income                         73.28
6      monthly_premium_auto                         73.28
7         n_open_complaints                         73.28
8               policy_type                         73.28
9             vehicle_class                         73.28
10       total_claim_amount                         73.28

In [ ]:
# First I would drop all the rows where all the columns are NaN.

In [22]:
data = data.dropna(how = 'all', subset = data.columns)

In [23]:
data.isna().sum()

customer                     0
state                        0
gender                     117
education                    0
customer_lifetime_value      3
income                       0
monthly_premium_auto         0
n_open_complaints            0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

In [ ]:
# Now, for the gender category, I would transform NaN in U for Unknown.

In [24]:
data['gender'] = data['gender'].fillna('U')

In [ ]:
# And for the customer_lifetime_value, I would first take a look in the data statistics:

In [25]:
data['customer_lifetime_value'].describe()

count    1.068000e+03
mean     7.936903e+05
std      6.434784e+05
min      2.004351e+05
25%      4.034080e+05
50%      5.881742e+05
75%      8.962872e+05
max      5.816655e+06
Name: customer_lifetime_value, dtype: float64

In [ ]:
# In this case, since there is a big range in the numerical data, with a high standard deviation, I will replace the NaN with the median value.

In [26]:
median_clv = data['customer_lifetime_value'].median()
data['customer_lifetime_value'] = data['customer_lifetime_value'].fillna(median_clv)

In [27]:
data.isnull()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,n_open_complaints,policy_type,vehicle_class,total_claim_amount
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
1066,False,False,False,False,False,False,False,False,False,False,False
1067,False,False,False,False,False,False,False,False,False,False,False
1068,False,False,False,False,False,False,False,False,False,False,False
1069,False,False,False,False,False,False,False,False,False,False,False
1070,False,False,False,False,False,False,False,False,False,False,False

In [30]:
def num_to_int(df: pd.DataFrame, columns_to_int: list) -> pd.DataFrame:
    df_copy = df.copy()
    for column in columns_to_int:
        df_copy[column] = df_copy[column].round().astype(int)
    return df_copy

In [37]:
to_int = ['customer_lifetime_value', 'income', 'monthly_premium_auto', 'n_open_complaints']
data = num_to_int(data, to_int)

In [39]:
print(data.dtypes)

customer                    object
state                       object
gender                      object
education                   object
customer_lifetime_value      int64
income                       int64
monthly_premium_auto         int64
n_open_complaints            int64
policy_type                 object
vehicle_class               object
total_claim_amount         float64
dtype: object

In [41]:
data['total_claim_amount'] = data['total_claim_amount'].round(2)
data.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,n_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,U,Master,588174,0,1000,0,Personal Auto,Four-Door Car,2.70
1,QZ44356,Arizona,F,Bachelor,697954,0,94,0,Personal Auto,Four-Door Car,1131.46
2,AI49188,Nevada,F,Bachelor,1288743,48767,108,0,Personal Auto,Two-Door Car,566.47
3,WW63253,California,M,Bachelor,764586,0,106,0,Corporate Auto,SUV,529.88
4,GA49547,Washington,M,High School or Below,536308,36357,68,0,Personal Auto,Four-Door Car,17.27

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [42]:
data.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1066    False
1067    False
1068    False
1069    False
1070    False
Length: 1071, dtype: bool

In [ ]:
# no duplicates

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [52]:
%%writefile functions_data_cleaning_formatting.py

import pandas as pd

def label_lower(df: pd.DataFrame) -> pd.DataFrame:
    '''
    This function formats the column names of the receive pd.DataFrame to lowercase letters.
    '''
    labels = []
    for column in df.columns:
        labels.append(column.lower())
    df.columns = labels
    return df

def to_int(df: pd.DataFrame, columns_to_int: list) -> pd.DataFrame:
    '''
    This function first rounds the decimals of numbers in the columns from a determined given list of columns in a pd.DataFrame then transforms it from their numeric type to an integer.
    '''
    df_copy = df.copy()
    for column in columns_to_int:
        df_copy[column] = df_copy[column].round().astype(int)
    return df_copy

def nan_values(df: pd.DataFrame) -> pd.DataFrame:
    '''
    This function creates a pd.DataFrame which shows the percentage of NaN or null values for all the columns in the provided pd.DataFrame.
    '''
    missing_values_df = pd.DataFrame(round(df.isna().sum()/len(df),4)*100) 
    missing_values_df = missing_values_df.reset_index() # replace, reset index and become columns
    missing_values_df.columns = ['column_name', 'percentage_of_missing_values'] # rename columns
    print(missing_values_df)
    return missing_values_df


def column_rename(df: pd.DataFrame, column = None) -> pd:DataFrame:
    '''
    Function for renaming columns.
    '''
    if column is not None:
        df = df.rename(columns=column)
    return df

def to_num(df: pd.DataFrame, columns_to_num: list) -> pd.DataFrame:
    '''
    This function transforms your dtype into integer in determined column(s).
    '''
    df_copy = df.copy()
    for column in columns_to_num:
        df_copy[column] =  pd.to_numeric(df_copy[column], errors = 'coerce')
    return df_copy

def to_round(df: pd.DataFrame, columns_to_round: list) -> pd.DataFrame:
    '''
    This function rounds your float number in determined column(s). 
    '''
    df_copy = df.copy()
    for column in columns_to_round:
        df_copy[column] =  df_copy[column].round(2)
    return df_copy

def all_gone(df: pd.DataFrame) -> pd.DataFrame:
    '''
    This function drops all the rows for which all columns are also NaN.
    '''
    df_copy = df.copy()
    df_copy = df_copy.dropna(how = 'all', subset = df.columns)
    return df_copy 

def clean_gender_column(df: pd.DataFrame) -> pd.DataFrame:
    '''
    This function will take a Pandas DataFrame as an input and it will replace the values in
    the "gender" column ins such a way that any gender which is not Male or Female with be 
    replaced by "U" otherwise the genders will be either "F" or "M"

    Inputs:
    df: Pandas DataFrame

    Outputs:
    A pandas DataFrame with the values in the "gender" column cleaned.
    '''

    df2 = df.copy()

    if "gender" not in df2.columns:
        return df2
    else:
        #df2['gender'] = df2['gender'].apply(lambda x: x[0].upper() if x[0].upper() in ['M', 'F'] else "U")
        df2['gender'] = list(map(lambda x: x[0].upper() if x[0].upper() in ['M', 'F'] else "U", df2['gender']))
        return df2

def to_median_na(df: pd.DataFrame, columns_to_median: list) -> pd.DataFrame:
    '''
    This function adds the median values of a column to the NaN values of it. 
    '''
    df_copy = df.copy()
    for column in columns_to_median:
        median_value = df_copy[column].median()
        df_copy[column] = df_copy[column].fillna(median_value)
    return df_copy

Writing functions_data_cleaning_formatting.py

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [46]:
review = ['total_claim_amount', 'customer_lifetime_value']
data[review].describe()

       total_claim_amount  customer_lifetime_value
count         1071.000000             1.071000e+03
mean           404.986928             7.931146e+05
std            293.027079             6.426676e+05
min              0.380000             2.004350e+05
25%            202.160000             4.048535e+05
50%            354.730000             5.881740e+05
75%            532.800000             8.945210e+05
max           2893.240000             5.816655e+06

In [48]:
df = data[ (data["customer_lifetime_value"] < data["customer_lifetime_value"].quantile(0.25)) & (data["total_claim_amount"] > data["total_claim_amount"].quantile(0.75))]
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,n_open_complaints,policy_type,vehicle_class,total_claim_amount
17,OE15005,California,U,College,394524,28855,101,0,Personal Auto,SUV,647.44
23,TZ98966,Nevada,U,Bachelor,245019,0,73,3,Corporate Auto,Four-Door Car,554.38
26,US89481,California,U,Bachelor,394637,0,111,0,Personal Auto,Four-Door Car,799.20
38,CM61827,Oregon,U,Bachelor,309003,0,90,0,Personal Auto,Two-Door Car,648.00
42,IL19217,California,U,Bachelor,393901,60021,99,0,Personal Auto,Four-Door Car,882.87

In [49]:
review = ['total_claim_amount', 'customer_lifetime_value']
df[review].describe()

       total_claim_amount  customer_lifetime_value
count           40.000000                40.000000
mean           723.776750            341577.875000
std            149.280273             56921.475939
min            537.600000            228760.000000
25%            633.380000            304220.500000
50%            685.285000            365995.500000
75%            799.200000            387365.000000
max           1185.990000            402381.000000